run/tracked/Clarifier/Rectangular/coarse/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 -0.0214);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (0 0 -0.0214);
    }
    outlet
    {
        type            zeroGradient;
    }
    sludgebottom
    {
        type            fixedValue;
        value           uniform (0 0 -0.619);
    }
    wall
    {
        type            noSlip;
    }
    watersurface
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
    /*
    wedge0
    {
        type            symmetry;
    }
    wedge1
    {
        type            symmetry;
    }
    */
}


// ************************************************************************* //
