run/tracked/Clarifier/Rectangular/coarse/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 0;
    }
    outlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    sludgebottom
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 0;
    }
    wall
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 0;
    }
    watersurface
    {
        type            prghTotalPressure;
        rho             rho;
        psi             none;
        gamma           1;
        p0              uniform 0;
        value           uniform 0;
        rho             rho;
    }
    /*
    wedge0
    {
        type            symmetry;
    }
    wedge1
    {
        type            symmetry;
    }
    */
}


// ************************************************************************* //
