run/tracked/Clarifier/Rectangular/coarse/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 1.449e-08;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 1.449e-08;
    }
    outlet
    {
        type            zeroGradient;
    }
    sludgebottom
    {
        type            zeroGradient;
    }
    wall
    {
        type            epsilonWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           uniform 1.449e-08;
    }
    watersurface
    {
        type            inletOutlet;
        inletValue      uniform 1.449e-08;
        value           uniform 1.449e-08;
    }
    /*
    wedge0
    {
        type            symmetry;
    }
    wedge1
    {
        type            symmetry;
    }
    */
}


// ************************************************************************* //
